CREATE TABLE IF NOT EXISTS users(
  id INT PRIMARY KEY AUTO_INCREMENT,
  name TEXT NOT NULL,
  age DATE NOT NULL,
  address TEXT NOT NULL
);

INSERT INTO users (name, age, address)
VALUES('Остап Бендер', '2005-01-01', 'Москва, Хитровка, 25'),
      ('Александр Корейко', '2006-01-01', 'Москва, Тверская, 11'),
      ('Шура Балаганов', '2010-04-26', 'Арбатов, Бульвар молодых дарований, 17'),
      ('Киса Воробьянинов', '1988-05-30', 'Старгород, Коминтерна, 5'),
      ('Володя Шарапов', '1995-06-11', 'Москва, Петровка, 38'),
      ('Глеб Жеглов', '1990-07-03', 'Москва, Петровка, 38'),
      ('Григорий Мелехов', '2004-08-14', 'Донецк, Артема, 44'),
      ('Илья Обломов', '1999-09-28', 'Санкт-Петербург, Гороховая, 64'),
      ('Анна Каренина', '1994-01-01', 'Москва, Пречистенка, 22'),
      ('Стива Облонский', '1993-12-31', 'Москва, Остоженка, 24'),
      ('Алесандр Привалов', '2002-10-07', 'Соловец, Лукоморье, 13'),
      ('Феликс Сорокин', '1991-11-04', 'Москва, Вернадского, 120');


-- SELECT name FROM users WHERE address LIKE '%Москва%'
-- AND YEAR(CURDATE()) - YEAR(age) >= 18
-- AND YEAR(CURDATE()) - YEAR(age) < 30;


SELECT * FROM users WHERE address LIKE '%Москва%'
AND
((YEAR(CURDATE())* 100 + MONTH(CURDATE())) * 100 + DAY(CURDATE())) -
((YEAR(age)* 100 + MONTH(age)) * 100 + DAY(age)) >= 10000 * 18
AND
((YEAR(CURDATE())* 100 + MONTH(CURDATE())) * 100 + DAY(CURDATE())) -
((YEAR(age)* 100 + MONTH(age)) * 100 + DAY(age)) < 10000 * 30
;